#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/davinci/aws-python-lambda-layer/runs/run-X7yqirAQUwzV15EV

Waiting for the plan to start...

Terraform v1.4.6
on linux_amd64
Initializing plugins and modules...
data.archive_file.python_lambda_package: Refreshing...
data.archive_file.python_lambda_package: Refresh complete after 0s [id=a806a327cace045e5d1b7d7a04fafe4ebb57c3df]
data.aws_iam_policy_document.lambda_logs: Refreshing...
data.aws_iam_policy_document.lambda_logs: Refresh complete after 0s [id=1254366649]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_cloudwatch_log_group.lambda_logs will be created
  + resource "aws_cloudwatch_log_group" "lambda_logs" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/lambda/lambda"
      + name_prefix       = (known after apply)
      + retention_in_days = 0
      + skip_destroy      = false
      + tags_all          = {
          + "GitHubRepo" = "aws-python-lambda-layer"
          + "Workspace"  = "aws-python-lambda-layer"
        }
    }

  # aws_iam_policy.iam_policy_for_lambda will be created
  + resource "aws_iam_policy" "iam_policy_for_lambda" {
      + arn         = (known after apply)
      + description = "AWS IAM Policy for managing aws lambda role"
      + id          = (known after apply)
      + name        = "aws_iam_policy_for_terraform_aws_lambda_log_role"
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "logs:PutLogEvents",
                          + "logs:CreateLogStream",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:logs:*:*:*"
                      + Sid      = ""
                    },
                  + {
                      + Action   = [
                          + "xray:PutTraceSegments",
                          + "xray:PutTelemetryRecords",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:xray:*:*:*"
                      + Sid      = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags_all    = {
          + "GitHubRepo" = "aws-python-lambda-layer"
          + "Workspace"  = "aws-python-lambda-layer"
        }
    }

  # aws_iam_role.iam_for_lambda will be created
  + resource "aws_iam_role" "iam_for_lambda" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "iam_for_lambda"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + role_last_used        = (known after apply)
      + tags_all              = {
          + "GitHubRepo" = "aws-python-lambda-layer"
          + "Workspace"  = "aws-python-lambda-layer"
        }
      + unique_id             = (known after apply)
    }

  # aws_iam_role_policy_attachment.attach_iam_policy_to_iam_role will be created
  + resource "aws_iam_role_policy_attachment" "attach_iam_policy_to_iam_role" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "iam_for_lambda"
    }

  # aws_lambda_function.lambda will be created
  + resource "aws_lambda_function" "lambda" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + description                    = "Dumb lambda function utilizing x-ray tracing layer"
      + filename                       = "lambda.zip"
      + function_name                  = "lambda"
      + handler                        = "handler.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + layers                         = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.8"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = "U7N8K7uanm8CaKc8uwQJB1/DHAmndcG5c69vtVYld+A="
      + source_code_size               = (known after apply)
      + tags_all                       = {
          + "GitHubRepo" = "aws-python-lambda-layer"
          + "Workspace"  = "aws-python-lambda-layer"
        }
      + timeout                        = 10
      + version                        = (known after apply)

      + tracing_config {
          + mode = "Active"
        }
    }

  # aws_lambda_layer_version.xray will be created
  + resource "aws_lambda_layer_version" "xray" {
      + arn                         = (known after apply)
      + compatible_runtimes         = [
          + "python3.8",
        ]
      + created_date                = (known after apply)
      + description                 = "aws-xray-sdk module"
      + filename                    = "./layer.zip"
      + id                          = (known after apply)
      + layer_arn                   = (known after apply)
      + layer_name                  = "aws-xray-sdk"
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      + skip_destroy                = false
      + source_code_hash            = (known after apply)
      + source_code_size            = (known after apply)
      + version                     = (known after apply)
    }

Plan: 6 to add, 0 to change, 0 to destroy.

```

</details>

*Pushed by: @jmeisele, Action: `pull_request`*